/*
task1//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/
isPrefix([], _). % пустой список префикс любого списка

isPrefix([H|T1], [H|T2]) :- 
    isPrefix(T1, T2). % если первые элементы равны, продолжаем проверку хвостов.


isSublist(Sublist, List) :- 
    isPrefix(Sublist, List). % префикс это также подсписок

isSublist(Sublist, [_|T]) :- 
    isSublist(Sublist, T). % рекурсивно проверяем подсписки хвоста списка


